Repository: parallelno/Vector06c
Catalog: Vector06c_Dev/_Projects/GameNonameBb/tools/Ay_Emul29b32W64/languages/Ay_Emul.*.po
Languages: ru

# basslight.basse_already
source: Already initialized/paused/whatever
ru: Уже проинициализировано/приостановлено/тому подобное

# basslight.basse_cantcratefile
source: Couldn't create the file
ru: Не удалось создать файл

# basslight.basse_cantfindsnddrv
source: Can't find a free sound driver
ru: Не удаётся найти свободный звуковой драйвер

# basslight.basse_cantgetchan
source: Can't get a free channel
ru: Не удаётся получить свободный канал

# basslight.basse_cantopenfile
source: Can't open the file
ru: Не удаётся открыть файл

# basslight.basse_chanfileend
source: The channel/file has ended
ru: Канал/файл закончился

# basslight.basse_codec
source: Codec is not available/supported
ru: Кодек не доступен/не поддерживается

# basslight.basse_connectiontimedout
source: Connection timedout
ru: Время на соединение вышло

# basslight.basse_decodchan
source: The channel is/isn't a "decoding channel"
ru: Канал декодируемый/не декодируемый

# basslight.basse_devicebusy
source: The device is busy
ru: Устройство занято

# basslight.basse_directxver
source: A sufficient DirectX version is not installed
ru: Необходимая версия DirectX не установлена

# basslight.basse_effectsnotenabled
source: Effects are not enabled
ru: Эффекты не разрешены

# basslight.basse_illegaldevice
source: Illegal device number
ru: Недопустимый номер устройства

# basslight.basse_illegalparam
source: An illegal parameter was specified
ru: Передан недопустимый параметр

# basslight.basse_illegalsamplerate
source: Illegal sample rate
ru: Недопустимая частота сэмплов

# basslight.basse_illegaltype
source: An illegal type was specified
ru: Указан недопустимый тип

# basslight.basse_invalidhnd
source: Invalid handle
ru: Недопустимый дескриптор

# basslight.basse_invalidpos
source: Invalid position
ru: Недопустимая позиция

# basslight.basse_mem
source: Memory error
ru: Ошибка памяти

# basslight.basse_modnoseqdata
source: The MOD music has no sequence data
ru: В музыке MOD нет данных последовательности

# basslight.basse_no3d
source: No 3D support
ru: Нет поддержки 3D

# basslight.basse_noeax
source: No EAX support
ru: Нет поддержки EAX

# basslight.basse_nohardvoices
source: No hardware voices available
ru: Не доступны аппаратные голоса

# basslight.basse_noinit
source: BASS_Init has not been successfully called
ru: Успешного вызова BASS_Init не было

# basslight.basse_nointernet
source: No internet connection could be opened
ru: Не открылось интернет-соединение

# basslight.basse_nostart
source: BASS_Start has not been successfully called
ru: Успешного вызова BASS_Start не было

# basslight.basse_notfilestream
source: The stream is not a file stream
ru: Данный поток не является файловым

# basslight.basse_notplaying
source: Not playing
ru: Нет воспроизведения

# basslight.basse_ok
source: All is OK
ru: Ошибок нет

# basslight.basse_reqdatanotavail
source: Requested data is not available
ru: Запрошенные данные не доступны

# basslight.basse_samplebuflost
source: The sample buffer was lost
ru: Буффер сэмплов был утерян

# basslight.basse_unavailspeaker
source: Unavailable speaker
ru: Недоступный динамик

# basslight.basse_unknown
source: Unknown error
ru: Неизвестная ошибка

# basslight.basse_unsupfileformat
source: Unsupported file format
ru: Не поддерживаемый формат файла

# basslight.basse_unsupsmpformat
source: Unsupported sample format
ru: Не поддерживаемый формат сэмплов

# basslight.basse_version
source: Invalid BASS version
ru: Неверная версия BASS

source: MCI error #
ru: Ошибка MCI №

source: No CD drives found
ru: CD приводов не найдено

source: Specified CD drive not found
ru: Указанный CD привод не найден

source: Anywhere
ru: Везде

source: Author name
ru: Имя автора

# findplitem.frmfndplitmfilename
source: File name
ru: Имя файла

source: Music title
ru: Название музыки

source: AY-3-8910, AY-3-8912 and YM2149F Emulator, Player, Converter and Music Ripper
ru: Эмулятор AY-3-8910, AY-3-8912 and YM2149F: проигрывание, конвертирование и поиск музыки

source: Analisis of file
ru: Анализ файла

# languages.mes_averager
source: Averager
ru: Усреднение

source: Ay_Emul.fmt loading error in line
ru: Ошибка загрузки Ay_Emul.fmt в строке

source: Ay_Emul data is removed from your system
ru: Данные Ay_Emul удалены из Вашей системы

# languages.mes_begin
source: Begin
ru: Начать

source: Can't calculate STP init address
ru: Не удалось вычислить адрес компиляции STP

source: Can not create destination folder
ru: Не удалось создать папку назначения

source: Can't extract track number from CDA file name
ru: Не удалось определить номер дорожки из имени CDA-файла

source: Can't open
ru: Не удалось открыть

# languages.mes_closebye
source: Close the program and delete Ay_Emul folder to complete uninstall. See you!
ru: Закройте программу и удалите папку с Ay_Emul для завершения деинсталляции. Увидимся!

source: Error: damaged file - SNDH ICE depacking
ru: Ошибка: файл повреждён - распаковка SNDH ICE

source: (excepting restoring file registration data, administrator rights needed)
ru: (за исключением восстановления данных о регистрации файлов, нужны права администратора)

source: exists. Overwrite?
ru: существует. Перезаписать?

# languages.mes_file
source: File
ru: Файл

source: FileOpen error
ru: Ошибка FileOpen

source: FileRead error
ru: Ошибка FileRead

source: FileSeek error
ru: Ошибка FileSeek

source: FIR
ru: КИХ

source: LZH compressed data is not valid
ru: сжатые данные LZH не корректны

source: ms
ru: мс

source: no song playing...
ru: ничего не воспроизводится...

source: is not AY-3-8910/12 Emulator v2.0 Skin File
ru: не является файлом обшивки AY-3-8910/12 Emulator v2.0

source: not found or access denied
ru: не найден или доступ запрещён

source: No valid destinations for selected mixer device
ru: У выбранного микшера нет подходящих выходов

source: No volume controls found for selected destination
ru: У выбранного выхода нет регуляторов

source: Open files from folder:
ru: Открыть файлы из папки:

source: pts
ru: тчк

source: Read after end of data
ru: Чтение за пределами данных

source: Read after end of file
ru: Чтение за пределами файла

source: Recurse subfolders
ru: Вложенные папки

source: Search string not found
ru: Искомая строка не найдена

source: Search for tunes in files
ru: Поиск в файлах

source: Seek after end of file
ru: Позиционирование за пределы файла

source: Select control:
ru: Выберите регулятор:

source: Select destination:
ru: Выберите выход:

source: Select folder
ru: Выберите папку

source: Select mixer device:
ru: Выберите регулятор громкости

source: Stop
ru: Стоп

source: System volume controls not detected
ru: Системные регуляторы громкости не обнаружены

source: ST11 block is too small in AY-file
ru: Блок ST11 слишком мал в AY-файле

source: Track length
ru: Длина трека

source: Unhandled error during adding file
ru: Необработанная ошибка во время добавления файла

source: Unsupported AY-file header
ru: Не поддерживаемый заголовок AY-файла

source: Unsupported AYM-file header
ru: Не поддерживаемый заголовок AYM-файла

source: Unsupported AYM-file revision
ru: Не поддерживаемая ревизия AYM-файла

source: Unsupported AY-file type
ru: Не поддерживаемый тип AY-файла

source: Unsupported EPSG-file computer type
ru: Не поддерживаемый тип компьютера EPSG-файла

source: Unsupported PSG-file header
ru: Не поддерживаемый заголовок PSG-файла

source: Unsupported PSG-file version
ru: Не поддерживаемая версия PSG-файла

source: Unsupported VTX-file header
ru: Не поддерживаемый заголовок VTX-файла

source: Unsupported YM-file header
ru: Не поддерживаемый заголовок YM-файла

source: Unsupported TS-file structure
ru: Не поддерживаемая структура TS-файла

source: Interrupted because of user wish.
ru: Прервано по запросу пользователя.

# languages.mes_winversion
source: Supported in Windows version only
ru: Только в Windows-версии

source: Converted by
ru: Конвертировал

source: Ripped by
ru: Выдрал

source: Application icon
ru: Для приложения

source: Author:
ru: Автор:

source: BASS files icon
ru: Файлы BASS

source: Icon
ru: Значок

source: Music files icon
ru: Для музыки

source: Playlists icon
ru: Для плейлистов

source: Skin files icon
ru: Для обшивок

source: 'Start' menu icon
ru: Меню "Пуск"

source: Tray icon
ru: Панель задач

# languages.t_allfiles
source: All files
ru: Все файлы

source: All supported types
ru: Все допустимые типы

source: Bad file structure
ru: Неправильная структура файла

source: Error calling BASS library
ru: Ошибка вызова библиотеки BASS

source: File not found
ru: Файл не найден

source: Address of compilation is not detected: not FLS-file
ru: Не удалось определить адрес компиляции: не FLS-файл

source: LZH data is not valid
ru: Данные в LZH ошибочные

source: Error reading file
ru: Ошибка во время чтения файла

source: About program
ru: О программе

source: Find next
ru: Найти далее

source: Find all
ru: Найти все

# tfrmfndplitm.button3.caption
source: Close
ru: Закрыть

source: Find playlist item
ru: Найти элемент списка

source: Search string
ru: Строка для поиска

source: Search area
ru: Область поиска

source: Jump
ru: Перейти

# tfrmjptime.button2.caption
source: Cancel
ru: Отмена

source: Jump to time
ru: Перейти на время

source: Minutes:Seconds
ru: Минуты:Секунды

# tfrmmixer.atarimonochk.caption
source: Mono
ru: Моно

source: Force mono mode for sound driver
ru: Включать моно режим звукового драйвера

source: YM mono
ru: YM моно

source: Force mono for sound chip channels
ru: Выбирать раскладку "Моно" для выходов сопроцессора

source: AY Emulation
ru: Эмуляция AY

source: Warning: AY-3-8910/YM2149F output levels can overflow
ru: Предупреждение: выходные уровни AY-3-8910/YM2149F могут переполниться

source: BASS v2.4 (optional)
ru: BASS v2.4 (при наличии)

source: Buffers
ru: Буферы

# tfrmmixer.button1.caption
source: Restore
ru: Восстановить

# TFRMMIXER.BUTTON2.CAPTION
source: Close
ru: Закрыть

source: Select
ru: Выбрать

source: Autodetect
ru: Автоопределение

source: Mixer
ru: Микшер

# tfrmmixer.checkbox1.caption
source: Get from list
ru: Брать из списка

source: Linear scale (as is)
ru: Линейная шкала (без корректировки)

source: Hann window
ru: Окно Ханна

source: Seek to first "Note On" MIDI-event
ru: Перемотать до первой ноты

source: Remove DC bias
ru: Убирать "постоянку"

# TFRMMIXER.CHECKBOX2.CAPTION
source: Get from list
ru: Брать из списка

# TFRMMIXER.CHECKBOX3.CAPTION
source: Get from list
ru: Брать из списка

source: Save volume position
ru: Запоминать уровень громкости

# TFRMMIXER.CHECKBOX8.CAPTION
source: Get from list
ru: Брать из списка

# TFRMMIXER.CHECKBOX9.CAPTION
source: Get from list
ru: Брать из списка

source: Warning: DMA-Sound+AY-3-8910/YM2149F output levels can overflow
ru: Предупреждение: выходные уровни DMA-Sound+AY-3-8910/YM2149F могут переполниться

# tfrmmixer.groupbox1.caption
source: Chip type
ru: Тип микросхемы

# tfrmmixer.groupbox10.caption
source: Device
ru: Устройство

source: Visualization
ru: Визуализация

source: Resampler
ru: Передискретизация

# TFRMMIXER.GROUPBOX13.CAPTION
source: Device
ru: Устройство

source: Connection parameters
ru: Параметры соединения

source: MC68000 frequency
ru: Частота MC68000

source: Atari ST emulation (SNDH)
ru: Эмуляция Atari ST (SNDH)

# tfrmmixer.groupbox2.caption
source: Sound chip frequency
ru: Частота микросхемы

source: Sample rate
ru: Частота сэмплов

source: Bit rate
ru: Бит на сэмпл

source: Channels
ru: Каналы

source: Interrupt frequency
ru: Частота прерываний

source: YM5, YM6, SNDH (MFP Timer)
ru: YM5, YM6, SNDH (таймер MFP)

source: Z80 frequency
ru: Частота Z80

# tfrmmixer.kusil.caption
source: Channels amplification
ru: Усиление каналов

source: TStates per frame
ru: Тиков на кадр

source: Number of FFT koef.:
ru: Количество коэф. FFT

source: User-Agent (empty to fill all parameters from BASS):
ru: User-Agent (если пусто, будет заполнено BASS):

# tfrmmixer.label16.caption
source: Left
ru: Левый

# tfrmmixer.label17.caption
source: Right
ru: Правый

# TFRMMIXER.LABEL18.CAPTION
source: Left
ru: Левый

# TFRMMIXER.LABEL19.CAPTION
source: Right
ru: Правый

source: AmpMin/AmpMax =
ru: УрМин/УрМакс =

# TFRMMIXER.LABEL20.CAPTION
source: Left
ru: Левый

# TFRMMIXER.LABEL21.CAPTION
source: Right
ru: Правый

# tfrmmixer.label22.caption
source: Hz
ru: Гц

# TFRMMIXER.LABEL23.CAPTION
source: Hz
ru: Гц

# TFRMMIXER.LABEL24.CAPTION
source: Hz
ru: Гц

# TFRMMIXER.LABEL25.CAPTION
source: Hz
ru: Гц

# TFRMMIXER.LABEL26.CAPTION
source: Hz
ru: Гц

# TFRMMIXER.LABEL27.CAPTION
source: Hz
ru: Гц

source: user:pass@server:port (empty string for system settings):
ru: user:pass@server:port (пустo – использовать системные)

source: Current volume control:
ru: Текущий регулятор громкости

source: Total length
ru: Общая длина

source: Buffer length
ru: Длина буфера

# tfrmmixer.label6.caption
source: Number of buffers
ru: Количество буферов

source: Interrupt offset
ru: Смещение прерывания

source: Preamp
ru: Общее

source: MIDIOut
ru: Выход MIDI

source: Use proxy
ru: Использовать прокси

source: 16 bit
ru: 16 бит

source: 8 bit
ru: 8 бит

# tfrmmixer.radiobutton13.caption
source: Stereo
ru: Стерео

# TFRMMIXER.RADIOBUTTON14.CAPTION
source: Mono
ru: Моно

# TFRMMIXER.RADIOBUTTON16.CAPTION
source: Another
ru: Другая

# TFRMMIXER.RADIOBUTTON20.CAPTION
source: Another
ru: Другая

# TFRMMIXER.RADIOBUTTON25.CAPTION
source: Another
ru: Другая

source: FIR-filter
ru: КИХ-фильтр

# TFRMMIXER.RADIOBUTTON27.CAPTION
source: Another
ru: Другая

# tfrmmixer.radiobutton28.caption
source: averager
ru: усреднение

# tfrmmixer.radiobutton31.caption
source: Another
ru: Другая

# tfrmmixer.radiobutton7.caption
source: Another
ru: Другая

source: Stop playing
ru: Остановить проигрывание

source: Helper
ru: Помощник

source: Length of one buffer
ru: Длина одного буфера

# TFRMMIXER.TRACKBAR9.HINT
source: Number of buffers
ru: Количество буферов

source: Warning: Turbo Sound output levels can overflow
ru: Предупреждение: выходные уровни Turbo Sound могут переполниться

source: Global Volume Control
ru: Регулятор громкости

source: Digital Sound
ru: Цифровой звук

source: Set
ru: Установить

# tfrmmxhlp.button2.caption
source: Cancel
ru: Отмена

source: Mixer Amplifier Helper
ru: Помощник расчета усилителя микшера

source: AY-3-8910/YM2149F Channels Allocation
ru: Расположение каналов AY-3-8910/YM2149F

source: Leave space for additional device
ru: Учесть дополнительное устройство

source: Load
ru: Загрузить

# tfrmpliedit.button2.caption
source: Save
ru: Сохранить

# tfrmpliedit.button4.caption
source: Cancel
ru: Отмена

source: List's Item Adjusting
ru: Настройки элемента списка

source: Information
ru: Информация

source: Playing
ru: Проигрывание

source: Chip
ru: Микросхема

source: Chip frequency
ru: Частота микросхемы

source: Player frequency
ru: Частота проигрывателя

source: Number of channels
ru: Число каналов

# tfrmpliedit.groupbox7.caption
source: Channels amplification
ru: Усиление каналов

source: Default list settings
ru: Общие настройки списка

# tfrmpliedit.groupbox9.caption
source: File
ru: Файл

# tfrmpliedit.label1.caption
source: Author
ru: Автор

source: Specific
ru: Особен.

source: Type
ru: Тип

source: Offset
ru: Смещение

source: Address
ru: Адрес

source: Time
ru: Время

source: Length
ru: Длина

source: Loop
ru: Цикл

# tfrmpliedit.label2.caption
source: Title
ru: Название

# tfrmpliedit.label3.caption
source: Program
ru: Программа

# tfrmpliedit.label4.caption
source: Tracker
ru: Редактор

source: Computer
ru: Платформа

source: Date
ru: Дата

source: Comment:
ru: Комментарий:

# tfrmpliedit.radiobutton10.caption
source: Stereo
ru: Стерео

# tfrmpliedit.radiobutton11.caption
source: Mono
ru: Моно

# tfrmpliedit.radiobutton12.caption
source: Another
ru: Другое

# tfrmpliedit.radiobutton13.caption
source: Standard
ru: Стандарт

# tfrmpliedit.radiobutton14.caption
source: Default
ru: По умолчанию

# TFRMPLIEDIT.RADIOBUTTON15.CAPTION
source: Default
ru: По умолчанию

# TFRMPLIEDIT.RADIOBUTTON16.CAPTION
source: Default
ru: По умолчанию

# TFRMPLIEDIT.RADIOBUTTON17.CAPTION
source: Default
ru: По умолчанию

# TFRMPLIEDIT.RADIOBUTTON18.CAPTION
source: Default
ru: По умолчанию

# tfrmpliedit.radiobutton7.caption
source: Another
ru: Другая

# TFRMPLIEDIT.RADIOBUTTON9.CAPTION
source: Another
ru: Другая

source: Sort by author
ru: Сортировать по автору

source: Sort by file name
ru: Сортировать по имени файла

source: Sort by file type
ru: Сортировка по типу файла

source: Sort by title
ru: Сортировка по названию

source: Playlist
ru: Список проигрывания

source: Deduplicate
ru: Убрать дубли

source: Find item...
ru: Найти элемент...

source: Convert to
ru: Конвертировать в

source: Item adjusting...
ru: Настройка элемента...

source: Open in editor
ru: Открыть в редакторе

source: Save as...
ru: Сохранить как...

source: Sort randomly
ru: Перемешать

source: Add items
ru: Добавить

source: Clear list
ru: Очистить

source: Save list
ru: Сохранить

source: List tools
ru: Инструменты

source: Abort current operation
ru: Прервать текущую операцию

source: Switch off tunes finder
ru: Выключить поиск модулей

source: Searching for tunes
ru: Поиск модулей

# tfrmselvolctrl.button2.caption
source: Cancel
ru: Отмена

source: For all users (Administrator rights needed)
ru: Для всех пользователей (требуются права администратора)

# TFRMTOOLS.BUTTON1.CAPTION
source: Choose...
ru: Обзор...

source: Add
ru: Добавить

source: Remove
ru: Убрать

# tfrmtools.button12.caption
source: Choose...
ru: Обзор...

# TFRMTOOLS.BUTTON13.CAPTION
source: Standard
ru: Стандарт

# TFRMTOOLS.BUTTON14.CAPTION
source: Save
ru: Сохранить

# TFRMTOOLS.BUTTON15.CAPTION
source: All/None
ru: Всё/Ничего

# TFRMTOOLS.BUTTON16.CAPTION
source: Apply
ru: Применить

# TFRMTOOLS.BUTTON17.CAPTION
source: All/None
ru: Всё/Ничего

# tfrmtools.button2.caption
source: Choose...
ru: Обзор...

# TFRMTOOLS.BUTTON3.CAPTION
source: Begin
ru: Начать

# TFRMTOOLS.BUTTON4.CAPTION
source: Close
ru: Закрыть

# tfrmtools.button5.caption
source: All/None
ru: Всё/Ничего

# TFRMTOOLS.BUTTON6.CAPTION
source: All/None
ru: Всё/Ничего

source: Uninstall
ru: Деинсталлировать

source: Register
ru: Зарегистрировать

source: Unregister
ru: Разрегистрировать

source: Tools
ru: Инструменты

source: Enabled
ru: Включено

source: Automatically save current
ru: Автоматически запоминать текущую

source: Save windows position
ru: Запоминать положение окон

source: Kill on exit
ru: Удалять на выходе

source: Kill on nothing
ru: Удалять при молчании

source: Do not check modules integrity (faster)
ru: Не проверять целостность модулей (быстрее)

source: Track descriptor
ru: Информация о треке

source: Application registration
ru: Регистрация приложения

source: General
ru: Общие

# TFRMTOOLS.GROUPBOX1.CAPTION
source: Other
ru: Другие

source: 'Start' menu
ru: Меню "Пуск"

source: Icon on system tray
ru: Значок на панели задач

source: Current Skin
ru: Текущая обшивка

source: Folder with music
ru: Папка с музыкой

source: Playlist colors and font
ru: Цвета и шрифт в плейлисте

source: Search for tunes
ru: Искать модули

source: Modules editor path
ru: Путь к редактору модулей

source: Priority
ru: Приоритет

source: Language
ru: Language (язык)

source: Default code page
ru: Кодировка (умолч.)

source: Code page
ru: Кодировка

source: Text
ru: Текст

source: Suffix
ru: Окончание

source: Nothing
ru: Молчание

source: Back
ru: Фон

source: SelText
ru: ВыдТекст

source: SelBack
ru: ВыдФон

source: Play Text
ru: Проигр. текст

source: Play Back
ru: Проигр. фон

source: Play SelText
ru: Проигр. ВыдТекст

source: Error Text
ru: Текст ошибки

source: Err SelText
ru: ВыдТекст ош.

# tfrmtools.label2.caption
source: File name
ru: Имя файла

source: Visualization period, ms
ru: Период визуализации, мс

source: Source files:
ru: Исходные файлы:

source: Work folder:
ru: Рабочая папка:

source: Work report:
ru: Протокол работы:

source: Skin's author
ru: Автор обшивки

source: Comment
ru: Комментарий

# TFRMTOOLS.LABEL8.CAPTION
source: File name
ru: Имя файла

source: Prefix
ru: Префикс

source: minimize
ru: сворачивать

source: idle
ru: низкий

source: normal
ru: обычный

source: high
ru: высокий

source: never
ru: никогда

source: always
ru: всегда

source: Searching for tunes in files
ru: Поиск модулей в файлах

source: Choose font...
ru: Выбрать шрифт...

# theadereditor.btapply.caption
source: Apply
ru: Применить

# THEADEREDITOR.BTRESTORE.CAPTION
source: Restore
ru: Восстановить

source: Information in the file header
ru: Информация в заголовке файла

source: Channels allocation
ru: Распределение каналов

# THEADEREDITOR.CHTYPEBOX.CAPTION
source: Chip type
ru: Тип микросхемы

# THEADEREDITOR.FRQBOX.CAPTION
source: Sound chip frequency
ru: Частота сопроцессора

# THEADEREDITOR.LABEL1.CAPTION
source: Hz
ru: Гц

# THEADEREDITOR.LABEL2.CAPTION
source: Hz
ru: Гц

# THEADEREDITOR.LABEL3.CAPTION
source: Hz
ru: Гц

# THEADEREDITOR.LABEL4.CAPTION
source: Hz
ru: Гц

# THEADEREDITOR.LABEL5.CAPTION
source: Hz
ru: Гц

# THEADEREDITOR.LABEL6.CAPTION
source: Hz
ru: Гц

# theadereditor.lbauthor.caption
source: Author
ru: Автор

# theadereditor.lbprogram.caption
source: Program
ru: Программа

# theadereditor.lbtitle.caption
source: Title
ru: Название

source: Total VBLs
ru: Количество квантов

# theadereditor.lbtracker.caption
source: Tracker
ru: Редактор

source: Year
ru: Год

source: Other information
ru: Прочая информация

# theadereditor.rbfrqother.caption
source: Other
ru: Другая

# THEADEREDITOR.RBPLFRQOTHER.CAPTION
source: Other
ru: Другая

source: Information about song
ru: Информация о песне

source: VBL frequency
ru: Частота прерываний

source: Loop VBL
ru: Квант цикла

# TSELDIRDLG.BUTTON2.CAPTION
source: Cancel
ru: Отмена

# tseldirdlg.playlistgb.caption
source: Playlist files
ru: Списки проигрывания

source: Include playlists
ru: Включать плейлисты

source: Exclude playlists
ru: Исключать плейлисты

source: Only playlists
ru: Только плейлисты
